<template>
  <div height="100%" class="chat-container">
    <div class="page.overlay">
      <app-headerpanel></app-headerpanel>
      <div id="categoryrow" class="category.row">
        <div class="category.group">
          <div class="rectangle.row category.card.focus category.card">
            <svg viewBox="0 0 1152 1024" class="icon_max icon.max.focus">
              <path
                d="M480 128c-50.666 0-99.582 7.95-145.386 23.628-42.924 14.694-81.114 35.436-113.502 61.646-60.044 48.59-93.112 110.802-93.112 175.174 0 35.99 10.066 70.948 29.92 103.898 20.686 34.34 51.898 65.794 90.26 90.958 30.44 19.968 50.936 51.952 56.362 87.95 0.902 5.99 1.63 12.006 2.18 18.032 2.722-2.52 5.424-5.114 8.114-7.794 24.138-24.040 56.688-37.312 90.322-37.312 5.348 0 10.718 0.336 16.094 1.018 19.36 2.452 39.124 3.696 58.748 3.696 50.666 0 99.58-7.948 145.384-23.628 42.926-14.692 81.116-35.434 113.504-61.644 60.046-48.59 93.112-110.802 93.112-175.174s-33.066-126.582-93.112-175.174c-32.388-26.212-70.578-46.952-113.504-61.646-45.804-15.678-94.718-23.628-145.384-23.628zM480 0v0c265.096 0 480 173.914 480 388.448s-214.904 388.448-480 388.448c-25.458 0-50.446-1.62-74.834-4.71-103.106 102.694-222.172 121.108-341.166 123.814v-25.134c64.252-31.354 116-88.466 116-153.734 0-9.106-0.712-18.048-2.030-26.794-108.558-71.214-177.97-179.988-177.97-301.89 0-214.534 214.904-388.448 480-388.448zM996 870.686c0 55.942 36.314 104.898 92 131.772v21.542c-103.126-2.318-197.786-18.102-287.142-106.126-21.14 2.65-42.794 4.040-64.858 4.040-95.47 0-183.408-25.758-253.614-69.040 144.674-0.506 281.26-46.854 384.834-130.672 52.208-42.252 93.394-91.826 122.414-147.348 30.766-58.866 46.366-121.582 46.366-186.406 0-10.448-0.45-20.836-1.258-31.168 72.57 59.934 117.258 141.622 117.258 231.676 0 104.488-60.158 197.722-154.24 258.764-1.142 7.496-1.76 15.16-1.76 22.966z"
              ></path>
            </svg>
          </div>
          <span class="text.small.semibold">Chat</span>
        </div>
        <div class="category.group">
          <div class="rectangle.row category.card">
            <svg viewBox="0 0 1024 1024" class="icon_max">
              <path
                d="M44 726h640v84h-640v-84zM684 640h-642q0-98 66-164t160-82 189 0 161 82 66 164zM42 938v-42h642v42q0 18-13 30t-31 12h-554q-18 0-31-12t-13-30zM770 980v-342q0-126-104-226-62-62-182-96l-12-100h212v-174h84v174h214l-72 702q-4 26-23 44t-45 18h-72z"
              ></path>
            </svg>
          </div>
          <span class="text.small.semibold">Food</span>
        </div>
        <div class="category.group">
          <div class="rectangle.row category.card">
            <svg viewBox="0 0 1024 1024" class="icon_max">
              <path
                d="M469.333 896c0-23.552-9.6-44.928-25.003-60.331s-36.779-25.003-60.331-25.003-44.928 9.6-60.331 25.003-25.003 36.779-25.003 60.331 9.6 44.928 25.003 60.331 36.779 25.003 60.331 25.003 44.928-9.6 60.331-25.003 25.003-36.779 25.003-60.331zM938.667 896c0-23.552-9.6-44.928-25.003-60.331s-36.779-25.003-60.331-25.003-44.928 9.6-60.331 25.003-25.003 36.779-25.003 60.331 9.6 44.928 25.003 60.331 36.779 25.003 60.331 25.003 44.928-9.6 60.331-25.003 25.003-36.779 25.003-60.331zM308.096 298.667h621.653l-58.496 306.816c-1.963 9.728-7.083 18.133-14.165 24.235-7.68 6.656-17.621 10.496-29.355 10.283h-415.317c-9.899 0.128-19.243-3.029-26.709-8.661-8.107-6.101-14.037-14.976-16.171-25.728zM42.667 85.333h135.68l36.181 180.864c4.608 18.645 21.419 32.469 41.472 32.469h52.096l-17.067-85.333h-35.029c-23.552 0-42.667 19.115-42.667 42.667 0 2.261 0.171 4.48 0.512 6.613 0.171 1.195 0.427 2.432 0.725 3.584l71.296 356.139c6.357 32.043 24.277 59.008 48.64 77.269 22.229 16.725 49.92 26.155 79.104 25.728h414.123c31.915 0.64 62.080-11.136 85.12-31.019 21.077-18.176 36.181-43.221 42.027-71.808l68.352-358.485c4.395-23.168-10.752-45.483-33.92-49.92-2.773-0.555-5.547-0.811-7.979-0.768h-690.347l-35.84-179.029c-4.011-19.712-21.205-34.304-41.813-34.304h-170.667c-23.552 0-42.667 19.115-42.667 42.667s19.115 42.667 42.667 42.667z"
              ></path>
            </svg>
            <div class="cart.number.corner">
              <span class="text.white.boldsmall">3</span>
            </div>
          </div>
          <span class="text.small.semibold">Cart</span>
        </div>
        <div class="category.group">
          <div class="rectangle.row category.card">
            <svg viewBox="0 0 1024 1024" class="icon_max">
              <path
                d="M780.501 183.168l-597.333 597.333c-16.683 16.683-16.683 43.691 0 60.331s43.691 16.683 60.331 0l597.333-597.333c16.683-16.683 16.683-43.691 0-60.331s-43.691-16.683-60.331 0zM426.667 277.333c0-41.216-16.768-78.635-43.733-105.6s-64.384-43.733-105.6-43.733-78.635 16.768-105.6 43.733-43.733 64.384-43.733 105.6 16.768 78.635 43.733 105.6 64.384 43.733 105.6 43.733 78.635-16.768 105.6-43.733 43.733-64.384 43.733-105.6zM341.333 277.333c0 17.664-7.125 33.621-18.731 45.269s-27.605 18.731-45.269 18.731-33.621-7.125-45.269-18.731-18.731-27.605-18.731-45.269 7.125-33.621 18.731-45.269 27.605-18.731 45.269-18.731 33.621 7.125 45.269 18.731 18.731 27.605 18.731 45.269zM896 746.667c0-41.216-16.768-78.635-43.733-105.6s-64.384-43.733-105.6-43.733-78.635 16.768-105.6 43.733-43.733 64.384-43.733 105.6 16.768 78.635 43.733 105.6 64.384 43.733 105.6 43.733 78.635-16.768 105.6-43.733 43.733-64.384 43.733-105.6zM810.667 746.667c0 17.664-7.125 33.621-18.731 45.269s-27.605 18.731-45.269 18.731-33.621-7.125-45.269-18.731-18.731-27.605-18.731-45.269 7.125-33.621 18.731-45.269 27.605-18.731 45.269-18.731 33.621 7.125 45.269 18.731 18.731 27.605 18.731 45.269z"
              ></path>
            </svg>
          </div>
          <span class="text.small.semibold">Deals</span>
        </div>
        <div class="category.group">
          <div class="rectangle.row category.card">
            <svg viewBox="0 0 1024 1024" class="icon_max">
              <path
                d="M590 332q126 26 212 123t94 227h-768q8-130 94-227t212-123q-8-16-8-34 0-36 25-60t61-24 61 24 25 60q0 18-8 34zM86 726h852v84h-852v-84z"
              ></path>
            </svg>
          </div>
          <span class="text.small.semibold">Services</span>
        </div>
        <div class="category.group">
          <div class="rectangle.row category.card">
            <svg viewBox="0 0 1024 1024" class="icon_max">
              <path
                d="M768 384v-86h-86v86h86zM768 554v-84h-86v84h86zM768 726v-86h-86v86h86zM342 384v-86h-86v86h86zM342 554v-84h-86v84h86zM342 726v-86h-86v86h86zM768 128h86v768h-86v-86h-86v86h-340v-86h-86v86h-86v-768h86v86h86v-86h340v86h86v-86z"
              ></path>
            </svg>
          </div>
          <span class="text.small.semibold">Movies</span>
        </div>
        <div class="category.group">
          <div class="rectangle.row category.card">
            <svg viewBox="0 0 1024 1024" class="icon_max">
              <path
                d="M590.464 747.733c-0.256 0.085-23.851 7.936-44.331 7.936-11.307 0-15.872-2.347-17.323-3.371-7.168-4.992-20.48-14.336 2.304-59.733l42.667-85.077c25.301-50.517 29.056-99.371 10.453-137.6-15.189-31.275-44.331-52.736-81.92-60.416-13.525-2.773-27.264-4.139-40.875-4.139-78.891 0-132.011 46.080-134.229 48.043-7.637 6.741-9.429 17.92-4.352 26.709 5.12 8.789 15.659 12.8 25.387 9.472 0.213-0.085 23.851-7.979 44.331-7.979 11.221 0 15.744 2.347 17.152 3.328 7.211 5.035 20.565 14.507-2.176 59.819l-42.667 85.12c-25.344 50.56-29.056 99.413-10.453 137.6 15.189 31.275 44.288 52.736 81.963 60.416 13.397 2.688 27.136 4.139 40.704 4.139 78.933 0 132.096-46.080 134.315-48.043 7.637-6.699 9.429-17.92 4.352-26.709-5.12-8.747-15.744-12.672-25.301-9.515z"
              ></path>
              <path
                d="M661.333 256.043c0 58.91-47.756 106.667-106.667 106.667s-106.667-47.756-106.667-106.667c0-58.91 47.756-106.667 106.667-106.667 58.91 0 106.667 47.756 106.667 106.667z"
              ></path>
            </svg>
          </div>
          <span class="text.small.semibold">Info</span>
        </div>
      </div>
      <div class="chat.body.panel body.panel">
        <div class="chat.window">
          <app-roomiemsghotel
            msgtext="Hi! Welcome to Ritz Carlton Langkawi. I am Jen and please drop me a message here if you need any assistance."
            timestamp="Front Desk - 13:59 PM"
            msgtranslate="你好！欢迎来到兰卡威丽思卡尔顿酒店。我是 Jen，如果您需要任何帮助，请在此处给我留言."
          ></app-roomiemsghotel>
          <app-roomiemsgguest
            msgtext="嗨，珍。谢谢你。如果我需要什么会发消息给你"
          ></app-roomiemsgguest>
          <app-roomiemsghotelimg
            image_src="https://images.unsplash.com/photo-1616581932361-f3aa7f297944?ixid=Mnw5MTMyMXwwfDF8c2VhcmNofDF8fHZlc3BhfGVufDB8fHx8MTY1MTMyODM5NQ&amp;ixlib=rb-1.2.1&amp;h=200"
            timestamp="Front Desk - 14:23 PM"
          ></app-roomiemsghotelimg>
          <app-roomiemsgguestimg
            image_src="https://images.unsplash.com/photo-1651252809208-3032d2dc7870?ixid=Mnw5MTMyMXwwfDF8YWxsfDN8fHx8fHwyfHwxNjUxMzI4MTUx&amp;ixlib=rb-1.2.1&amp;w=1500"
          ></app-roomiemsgguestimg>
          <app-roomiemsghotelbutton
            button="促销活动"
            msgtext="Check out our deals and promos"
            timestamp="Front Desk - 13:55 PM"
            msgtranslate="查看我们的优惠和促销"
          ></app-roomiemsghotelbutton>
          <app-roomiemsgguestbutton
            button="订单"
            msgtext="食品订单 - 3 件商品 - 已发送"
            image_src="/playground_assets/double-tick-1500h.png"
          ></app-roomiemsgguestbutton>
          <app-roomiemsghotel
            msgtext="Your Food order is confirmed and estimated time is 25 mins."
            timestamp="Room Service - 14:03 PM"
            msgtranslate="您的食品订单已确认，预计时间为 25 分钟。
  "
            rootClassName="roomiemsghotel-root-class-name"
          ></app-roomiemsghotel>
          <app-roomiemsghotelbutton
            button="已收到"
            msgtext="Your order has been delivered. Bon appetit!"
            timestamp="Room Service - 14:38 PM"
            msgtranslate="您的订单已送达。胃口大开！"
            rootClassName="roomiemsghotelbutton-root-class-name"
          ></app-roomiemsghotelbutton>
        </div>
        <div class="input.group">
          <div class="input.container">
            <input
              type="text"
              id="messagebar"
              placeholder="type message"
              class="msg.text input msg.text.pc.nomargin"
            />
            <svg viewBox="0 0 1024 1024" class="chat.msg.icon">
              <path
                d="M213.333 85.333c-35.328 0-67.413 14.379-90.496 37.504s-37.504 55.168-37.504 90.496v597.333c0 35.328 14.379 67.413 37.504 90.496s55.168 37.504 90.496 37.504h597.333c35.328 0 67.413-14.379 90.496-37.504s37.504-55.168 37.504-90.496v-597.333c0-35.328-14.379-67.413-37.504-90.496s-55.168-37.504-90.496-37.504zM469.333 362.667c0-29.44-11.989-56.149-31.232-75.435s-45.995-31.232-75.435-31.232-56.149 11.989-75.435 31.232-31.232 45.995-31.232 75.435 11.989 56.149 31.232 75.435 45.995 31.232 75.435 31.232 56.149-11.989 75.435-31.232 31.232-45.995 31.232-75.435zM384 362.667c0 5.888-2.347 11.179-6.229 15.104s-9.216 6.229-15.104 6.229-11.179-2.347-15.104-6.229-6.229-9.216-6.229-15.104 2.347-11.179 6.229-15.104 9.216-6.229 15.104-6.229 11.179 2.347 15.104 6.229 6.229 9.216 6.229 15.104zM316.331 853.333l366.336-366.336 170.667 170.667v153.003c0 11.776-4.736 22.4-12.501 30.165s-18.389 12.501-30.165 12.501zM853.333 537.003l-140.501-140.501c-16.683-16.683-43.691-16.683-60.331 0l-454.144 454.144c-5.76-2.133-10.88-5.504-15.189-9.813-7.765-7.765-12.501-18.389-12.501-30.165v-597.333c0-11.776 4.736-22.4 12.501-30.165s18.389-12.501 30.165-12.501h597.333c11.776 0 22.4 4.736 30.165 12.501s12.501 18.389 12.501 30.165z"
              ></path></svg
            ><svg viewBox="0 0 1024 1024" class="chat.msg.icon">
              <path
                d="M1024 810.667v-469.333c0-35.328-14.379-67.413-37.504-90.496s-55.168-37.504-90.496-37.504h-147.84l-72.661-109.013c-7.765-11.52-20.736-18.987-35.499-18.987h-256c-13.909 0.085-27.307 6.741-35.499 18.987l-72.661 109.013h-147.84c-35.328 0-67.413 14.379-90.496 37.504s-37.504 55.168-37.504 90.496v469.333c0 35.328 14.379 67.413 37.504 90.496s55.168 37.504 90.496 37.504h768c35.328 0 67.413-14.379 90.496-37.504s37.504-55.168 37.504-90.496zM938.667 810.667c0 11.776-4.736 22.4-12.501 30.165s-18.389 12.501-30.165 12.501h-768c-11.776 0-22.4-4.736-30.165-12.501s-12.501-18.389-12.501-30.165v-469.333c0-11.776 4.736-22.4 12.501-30.165s18.389-12.501 30.165-12.501h170.667c14.763 0 27.733-7.467 35.499-18.987l72.661-109.013h210.347l72.661 109.013c8.192 12.245 21.589 18.901 35.499 18.987h170.667c11.776 0 22.4 4.736 30.165 12.501s12.501 18.389 12.501 30.165zM725.333 554.667c0-58.88-23.936-112.299-62.464-150.869s-91.989-62.464-150.869-62.464-112.299 23.936-150.869 62.464-62.464 91.989-62.464 150.869 23.936 112.299 62.464 150.869 91.989 62.464 150.869 62.464 112.299-23.936 150.869-62.464 62.464-91.989 62.464-150.869zM640 554.667c0 35.371-14.293 67.285-37.504 90.496s-55.125 37.504-90.496 37.504-67.285-14.293-90.496-37.504-37.504-55.125-37.504-90.496 14.293-67.285 37.504-90.496 55.125-37.504 90.496-37.504 67.285 14.293 90.496 37.504 37.504 55.125 37.504 90.496z"
              ></path>
            </svg>
          </div>
          <svg viewBox="0 0 1024 1024" class="chat.send.icon">
            <path d="M86 896v-298l640-86-640-86v-298l896 384z"></path>
          </svg>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import AppHeaderpanel from '../components/headerpanel'
import AppRoomiemsghotel from '../components/roomiemsghotel'
import AppRoomiemsgguest from '../components/roomiemsgguest'
import AppRoomiemsghotelimg from '../components/roomiemsghotelimg'
import AppRoomiemsgguestimg from '../components/roomiemsgguestimg'
import AppRoomiemsghotelbutton from '../components/roomiemsghotelbutton'
import AppRoomiemsgguestbutton from '../components/roomiemsgguestbutton'

export default {
  name: 'Chat',
  components: {
    AppHeaderpanel,
    AppRoomiemsghotel,
    AppRoomiemsgguest,
    AppRoomiemsghotelimg,
    AppRoomiemsgguestimg,
    AppRoomiemsghotelbutton,
    AppRoomiemsgguestbutton,
  },
  metaInfo: {
    title: 'chat - Roomie Web 3.0',
    meta: [
      {
        property: 'og:title',
        content: 'chat - Roomie Web 3.0',
      },
    ],
  },
}
</script>

<style scoped>
.chat-container {
  width: 100%;
  height: 100vh;
  display: flex;
  overflow: auto;
  min-height: 100vh;
  align-items: center;
  flex-direction: column;
}
</style>
